IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_nwreg_regs.xml
<module id="NWREG" HW_revision="" description="NWREG Registers">
	<register id="IIDX" width="32" page="1" offset="0x10" internal="0" description="Interrupt Index Register">
		<bitfield id="STAT" description="STAT bit field" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="IMASK" width="32" page="1" offset="0x14" internal="0" description="Interrupt Mask Register">
		<bitfield id="DONE" description="DONE bit field" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="RIS" width="32" page="1" offset="0x18" internal="0" description="Raw Interrupt Status Register">
		<bitfield id="DONE" description="DONE bit field" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="MIS" width="32" page="1" offset="0x1c" internal="0" description="Masked Interrupt Status Register">
		<bitfield id="DONE" description="DONE bit field" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="ISET" width="32" page="1" offset="0x20" internal="0" description="Interrupt Set Register">
		<bitfield id="DONE" description="DONE bit field" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ICLR" width="32" page="1" offset="0x24" internal="0" description="Interrupt Clear Register">
		<bitfield id="DONE" description="DONE bit field" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="EVT_MODE" width="32" page="1" offset="0x70" internal="0" description="Event Mode">
		<bitfield id="INT0_CFG" description="INT0_CFG bit field" begin="1" end="0" width="2" rwaccess="R"/>
	</register>
	<register id="DESC" width="32" page="1" offset="0x7e" internal="0" description="DESC Register">
		<bitfield id="MINREV" description="MINREV bit field" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="MAJREV" description="MAJREV bit field" begin="7" end="4" width="4" rwaccess="R"/>
		<bitfield id="INSTNUM" description="INSTNUM bit field" begin="11" end="8" width="4" rwaccess="R"/>
		<bitfield id="FEATUREVER" description="FEATUREVER bit field" begin="15" end="12" width="4" rwaccess="R"/>
		<bitfield id="MODULEID" description="MODULEID bit field" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="CMDEXEC" width="32" page="1" offset="0x80" internal="0" description="Command Execute Register">
		<bitfield id="VAL" description="VAL bit field" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CMDTYPE" width="32" page="1" offset="0x82" internal="0" description="CMDTYPE Register">
		<bitfield id="COMMAND" description="COMMAND bit field" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="SIZE" description="SIZE bit field" begin="6" end="4" width="3" rwaccess="RW"/>
	</register>
	<register id="CMDCTL" width="32" page="1" offset="0x84" internal="0" description="CMDCTL Register">
		<bitfield id="MODESEL" description="MODESEL bit field" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="BANKSEL" description="BANKSEL bit field" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="REGIONSEL" description="REGIONSEL bit field" begin="12" end="9" width="4" rwaccess="RW"/>
		<bitfield id="PREVEREN" description="PREVEREN bit field" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="POSTVEREN" description="POSTVEREN bit field" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ADDRXLATEOVR" description="ADDRXLATEOVR bit field" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ECCGENOVR" description="ECCGENOVR bit field" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PROGMASKDIS" description="PROGMASKDIS bit field" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ERASEMASKDIS" description="ERASEMASKDIS bit field" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SSERASEDIS" description="SSERASEDIS bit field" begin="20" end="20" width="1" rwaccess="RW"/>
	</register>
	<register id="CMDADDR" width="32" page="1" offset="0x90" internal="0" description="Command Address Register">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDBYTEN" width="32" page="1" offset="0x92" internal="0" description="Command Program Byte Enable Register">
		<bitfield id="VAL" description="VAL bit field" begin="17" end="0" width="18" rwaccess="RW"/>
	</register>
	<register id="CMDDATAINDEX" width="32" page="1" offset="0x96" internal="0" description="Command Data Index Register">
		<bitfield id="VAL" description="VAL bit field" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="CMDDATA0" width="32" page="1" offset="0x98" internal="0" description="Command Data Register 0">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA1" width="32" page="1" offset="0x9a" internal="0" description="Command Data Register 1">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA2" width="32" page="1" offset="0x9c" internal="0" description="Command Data Register 2">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA3" width="32" page="1" offset="0x9e" internal="0" description="Command Data Register Bits 127:96">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA4" width="32" page="1" offset="0xa0" internal="0" description="Command Data Register 4">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA5" width="32" page="1" offset="0xa2" internal="0" description="Command Data Register 5">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA6" width="32" page="1" offset="0xa4" internal="0" description="Command Data Register 6">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA7" width="32" page="1" offset="0xa6" internal="0" description="Command Data Register 7">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA8" width="32" page="1" offset="0xa8" internal="0" description="Command Data Register 8">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA9" width="32" page="1" offset="0xaa" internal="0" description="Command Data Register 9">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA10" width="32" page="1" offset="0xac" internal="0" description="Command Data Register 10">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA11" width="32" page="1" offset="0xae" internal="0" description="Command Data Register 11">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA12" width="32" page="1" offset="0xb0" internal="0" description="Command Data Register 12">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA13" width="32" page="1" offset="0xb2" internal="0" description="Command Data Register 13">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA14" width="32" page="1" offset="0xb4" internal="0" description="Command Data Register 14">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATA15" width="32" page="1" offset="0xb6" internal="0" description="Command Data Register 15">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDDATAECC0" width="32" page="1" offset="0xd8" internal="0" description="CMDDATAECC0 Register">
		<bitfield id="VAL0" description="VAL0 bit field" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="VAL1" description="VAL1 bit field" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="CMDDATAECC1" width="32" page="1" offset="0xda" internal="0" description="CMDDATAECC1 Register">
		<bitfield id="VAL0" description="VAL0 bit field" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="VAL1" description="VAL1 bit field" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="CMDDATAECC2" width="32" page="1" offset="0xdc" internal="0" description="CMDDATAECC2 Register">
		<bitfield id="VAL0" description="VAL0 bit field" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="VAL1" description="VAL1 bit field" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="CMDDATAECC3" width="32" page="1" offset="0xde" internal="0" description="CMDDATAECC3 Register">
		<bitfield id="VAL0" description="VAL0 bit field" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="VAL1" description="VAL1 bit field" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="CMDWEPROTA" width="32" page="1" offset="0xe8" internal="0" description="Command Write Erase Protect A Register">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDWEPROTB" width="32" page="1" offset="0xea" internal="0" description="Command Write Erase Protect B Register">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDWEPROTNM" width="32" page="1" offset="0x108" internal="0" description="Command Write Erase Protect Non-Main Register">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMDWEPROTTR" width="32" page="1" offset="0x10a" internal="0" description="Command Write Erase Protect Trim Register">
		<bitfield id="VAL" description="VAL bit field" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="CMDWEPROTEN" width="32" page="1" offset="0x10c" internal="0" description="Command Write Erase Protect Engr Register">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CFGCMD" width="32" page="1" offset="0x1d8" internal="0" description="Command Configuration Register">
		<bitfield id="WAITSTATE" description="WAITSTATE bit field" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="CFGPCNT" width="32" page="1" offset="0x1da" internal="0" description="CFGPCNT Register">
		<bitfield id="MAXPCNTOVR" description="MAXPCNTOVR bit field" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MAXPCNTVAL" description="MAXPCNTVAL bit field" begin="11" end="4" width="8" rwaccess="RW"/>
	</register>
	<register id="STATCMD" width="32" page="1" offset="0x1e8" internal="0" description="STATCMD Register">
		<bitfield id="CMDDONE" description="CMDDONE bit field" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CMDPASS" description="CMDPASS bit field" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CMDINPROGRESS" description="CMDINPROGRESS bit field" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="FAILWEPROT" description="FAILWEPROT bit field" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="FAILVERIFY" description="FAILVERIFY bit field" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="FAILILLADDR" description="FAILILLADDR bit field" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="FAILMODE" description="FAILMODE bit field" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="FAILMISC" description="FAILMISC bit field" begin="12" end="12" width="1" rwaccess="R"/>
	</register>
	<register id="STATADDR" width="32" page="1" offset="0x1ea" internal="0" description="STATADDR Register">
		<bitfield id="BANKADDR" description="BANKADDR bit field" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="REGIONID" description="REGIONID bit field" begin="20" end="16" width="5" rwaccess="R"/>
		<bitfield id="BANKID" description="BANKID bit field" begin="25" end="21" width="5" rwaccess="R"/>
	</register>
	<register id="STATPCNT" width="32" page="1" offset="0x1ec" internal="0" description="Pulse Count Status Register">
		<bitfield id="PULSECNT" description="PULSECNT bit field" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="STATMODE" width="32" page="1" offset="0x1ee" internal="0" description="STATMODE Register">
		<bitfield id="BANKNOTINRD" description="BANKNOTINRD bit field" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="BANKMODE" description="BANKMODE bit field" begin="11" end="8" width="4" rwaccess="R"/>
	</register>
	<register id="GBLINFO0" width="32" page="1" offset="0x1f8" internal="0" description="GBLINFO0 Register">
		<bitfield id="SECTORSIZE" description="SECTORSIZE bit field" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="NUMBANKS" description="NUMBANKS bit field" begin="18" end="16" width="3" rwaccess="R"/>
	</register>
	<register id="GBLINFO1" width="32" page="1" offset="0x1fa" internal="0" description="GBLINFO1 Register">
		<bitfield id="DATAWIDTH" description="DATAWIDTH bit field" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="ECCWIDTH" description="ECCWIDTH bit field" begin="12" end="8" width="5" rwaccess="R"/>
		<bitfield id="REDWIDTH" description="REDWIDTH bit field" begin="18" end="16" width="3" rwaccess="R"/>
	</register>
	<register id="BANK0INFO0" width="32" page="1" offset="0x200" internal="0" description="Bank Information Register 0 for Bank 0">
		<bitfield id="MAINSIZE" description="MAINSIZE bit field" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="BANK0INFO1" width="32" page="1" offset="0x202" internal="0" description="BANK0INFO1 Register">
		<bitfield id="NONMAINSIZE" description="NONMAINSIZE bit field" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="TRIMSIZE" description="TRIMSIZE bit field" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="ENGRSIZE" description="ENGRSIZE bit field" begin="23" end="16" width="8" rwaccess="R"/>
	</register>
	<register id="BANK0TRIM0" width="32" page="1" offset="0x318" internal="0" description="Bank 0 Trim 0 Register">
		<bitfield id="VAL" description="VAL bit field" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BANK0TRIM1" width="32" page="1" offset="0x31a" internal="0" description="Bank 0 Trim 1 Register">
		<bitfield id="VAL" description="VAL bit field" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
</module>
